v2206/solver_ADMFoam/ADTank_lam_newMesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// application     buoyantBoussinesqPimpleFoam;
// application     ADMSimpleFoam;
application     ADMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;
deltaT          0.1;
writeInterval   1;

// endTime         200;
// deltaT          0.01;
// writeInterval   10;

adjustableRunTime yes; 

writeControl    runTime;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   5;

adjustTimeStep  true;

runTimeModifiable true;

maxCo           10;
// maxCo           40;

maxDeltaT       1;

functions
{
    // =========================================================
	#include "linesVertDict"
    #include "linesHoriDict"
}


// ************************************************************************* //
