v2206/solver_ADMFoam/ADTank_lam_newMesh/0.orig/Sh2

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Sh2;

}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField	uniform 2.5055e-07;

boundaryField
{
    allBoundary
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    GeoTop
    {
        type            zeroGradient;
    }

    GeoTank
    {
        type            zeroGradient;
    }

    GeoShaft
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
