v2206/solver_ADMFoam/ADTank_lam_newMesh/system/linesUHoriDict

	// Mid lines ===============================================================================

	mid_00
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.009587131702242374  -0.10958141679009199  0.0);
				end					(0.009587131702242388  0.10958141679009199  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	mid_01
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.07216649318895578  -0.08301805382450496  0.0);
				end					(0.0721664931889558  0.08301805382450494  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	mid_02
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.10718070712637588  -0.024744615977825183  0.0);
				end					(0.1071807071263759  0.02474461597782517  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	mid_03
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.10125553387976845  0.04298042413382008  0.0);
				end					(0.10125553387976845  -0.0429804241338201  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	mid_04
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.056654188240105985  0.09428840307723232  0.0);
				end					(0.05665418824010597  -0.09428840307723234  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	mid_05
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.05665418824010596  -0.09428840307723235  0.0);
				end					(0.05665418824010597  0.09428840307723234  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	mid_06
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.10125553387976842  -0.04298042413382012  0.0);
				end					(0.10125553387976843  0.04298042413382011  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	mid_07
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.1071807071263759  0.02474461597782514  0.0);
				end					(0.1071807071263759  -0.024744615977825155  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	mid_08
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.07216649318895581  0.08301805382450492  0.0);
				end					(0.07216649318895581  -0.08301805382450493  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	mid_09
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.009587131702242416  0.10958141679009199  0.0);
				end					(0.009587131702242402  -0.10958141679009199  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

    // Lower lines ===============================================================================
    
    lower_00
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.009587131702242374  -0.10958141679009199  -0.07);
				end					(0.009587131702242388  0.10958141679009199  -0.07);
				nPoints				500;
			}
		);
		fields	(U);
	}

	lower_01
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.07216649318895578  -0.08301805382450496  -0.07);
				end					(0.0721664931889558  0.08301805382450494  -0.07);
				nPoints				500;
			}
		);
		fields	(U);
	}

	lower_02
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.10718070712637588  -0.024744615977825183  -0.07);
				end					(0.1071807071263759  0.02474461597782517  -0.07);
				nPoints				500;
			}
		);
		fields	(U);
	}

	lower_03
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.10125553387976845  0.04298042413382008  -0.07);
				end					(0.10125553387976845  -0.0429804241338201  -0.07);
				nPoints				500;
			}
		);
		fields	(U);
	}

	lower_04
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.056654188240105985  0.09428840307723232  -0.07);
				end					(0.05665418824010597  -0.09428840307723234  -0.07);
				nPoints				500;
			}
		);
		fields	(U);
	}

	lower_05
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.05665418824010596  -0.09428840307723235  -0.07);
				end					(0.05665418824010597  0.09428840307723234  -0.07);
				nPoints				500;
			}
		);
		fields	(U);
	}

	lower_06
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.10125553387976842  -0.04298042413382012  -0.07);
				end					(0.10125553387976843  0.04298042413382011  -0.07);
				nPoints				500;
			}
		);
		fields	(U);
	}

	lower_07
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.1071807071263759  0.02474461597782514  -0.07);
				end					(0.1071807071263759  -0.024744615977825155  -0.07);
				nPoints				500;
			}
		);
		fields	(U);
	}

	lower_08
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.07216649318895581  0.08301805382450492  -0.07);
				end					(0.07216649318895581  -0.08301805382450493  -0.07);
				nPoints				500;
			}
		);
		fields	(U);
	}

	lower_09
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.009587131702242416  0.10958141679009199  -0.07);
				end					(0.009587131702242402  -0.10958141679009199  -0.07);
				nPoints				500;
			}
		);
		fields	(U);
	}
