v2206/solver_ADMFoam/ADTank_lam_newMesh/system/linesUVertDict
    // U ===================================================================================
	
    vert_00_U
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				1;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.002614672282429738  -0.02988584094275236  -0.2);
				end					(-0.002614672282429738  -0.02988584094275236  0.15);
				nPoints				500;
			}
		);
		fields	(U);
	}

	vert_01_U
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				1;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(0.002614672282429738  0.02988584094275236  -0.2);
				end					(0.002614672282429738  0.02988584094275236  0.15);
				nPoints				500;
			}
		);
		fields	(U);
	}

	vert_02_U
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				1;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.01968177086971521  -0.02264128740668317  -0.2);
				end					(-0.01968177086971521  -0.02264128740668317  0.15);
				nPoints				500;
			}
		);
		fields	(U);
	}

	vert_03_U
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				1;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(0.01968177086971521  0.02264128740668317  -0.2);
				end					(0.01968177086971521  0.02264128740668317  0.15);
				nPoints				500;
			}
		);
		fields	(U);
	}

	vert_04_U
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				1;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.029231101943557058  -0.006748531630315959  -0.2);
				end					(-0.029231101943557058  -0.006748531630315959  0.15);
				nPoints				500;
			}
		);
		fields	(U);
	}

	vert_05_U
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				1;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(0.029231101943557058  0.006748531630315959  -0.2);
				end					(0.029231101943557058  0.006748531630315959  0.15);
				nPoints				500;
			}
		);
		fields	(U);
	}

	vert_06_U
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				1;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.02761514560357321  0.011721933854678204  -0.2);
				end					(-0.02761514560357321  0.011721933854678204  0.15);
				nPoints				500;
			}
		);
		fields	(U);
	}

	vert_07_U
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				1;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(0.02761514560357321  -0.011721933854678204  -0.2);
				end					(0.02761514560357321  -0.011721933854678204  0.15);
				nPoints				500;
			}
		);
		fields	(U);
	}

	vert_08_U
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				1;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.015451142247301632  0.025715019021063358  -0.2);
				end					(-0.015451142247301632  0.025715019021063358  0.15);
				nPoints				500;
			}
		);
		fields	(U);
	}

	vert_09_U
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				1;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(0.015451142247301632  -0.025715019021063358  -0.2);
				end					(0.015451142247301632  -0.025715019021063358  0.15);
				nPoints				500;
			}
		);
		fields	(U);
	}

    // Sac =================================================================================

    // vert_00_Sch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart					45;
	// 	writeControl				$writeControl;
	// 	writeInterval				1;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(-0.002614672282429738  -0.02988584094275236  -0.2);
	// 			end					(-0.002614672282429738  -0.02988584094275236  0.15);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sch4);
	// }

	// vert_01_Sch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart					45;
	// 	writeControl				$writeControl;
	// 	writeInterval				1;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(0.002614672282429738  0.02988584094275236  -0.2);
	// 			end					(0.002614672282429738  0.02988584094275236  0.15);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sch4);
	// }

	// vert_02_Sch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart					45;
	// 	writeControl				$writeControl;
	// 	writeInterval				1;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(-0.01968177086971521  -0.02264128740668317  -0.2);
	// 			end					(-0.01968177086971521  -0.02264128740668317  0.15);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sch4);
	// }

	// vert_03_Sch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart					45;
	// 	writeControl				$writeControl;
	// 	writeInterval				1;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(0.01968177086971521  0.02264128740668317  -0.2);
	// 			end					(0.01968177086971521  0.02264128740668317  0.15);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sch4);
	// }

	// vert_04_Sch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart					45;
	// 	writeControl				$writeControl;
	// 	writeInterval				1;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(-0.029231101943557058  -0.006748531630315959  -0.2);
	// 			end					(-0.029231101943557058  -0.006748531630315959  0.15);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sch4);
	// }

	// vert_05_Sch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart					45;
	// 	writeControl				$writeControl;
	// 	writeInterval				1;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(0.029231101943557058  0.006748531630315959  -0.2);
	// 			end					(0.029231101943557058  0.006748531630315959  0.15);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sch4);
	// }

	// vert_06_Sch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart					45;
	// 	writeControl				$writeControl;
	// 	writeInterval				1;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(-0.02761514560357321  0.011721933854678204  -0.2);
	// 			end					(-0.02761514560357321  0.011721933854678204  0.15);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sch4);
	// }

	// vert_07_Sch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart					45;
	// 	writeControl				$writeControl;
	// 	writeInterval				1;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(0.02761514560357321  -0.011721933854678204  -0.2);
	// 			end					(0.02761514560357321  -0.011721933854678204  0.15);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sch4);
	// }

	// vert_08_Sch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart					45;
	// 	writeControl				$writeControl;
	// 	writeInterval				1;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(-0.015451142247301632  0.025715019021063358  -0.2);
	// 			end					(-0.015451142247301632  0.025715019021063358  0.15);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sch4);
	// }

	// vert_09_Sch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart					45;
	// 	writeControl				$writeControl;
	// 	writeInterval				1;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(0.015451142247301632  -0.025715019021063358  -0.2);
	// 			end					(0.015451142247301632  -0.025715019021063358  0.15);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sch4);
	// }