v2206/solver_ADMFoam/ADTank_lam_newMesh/system/linesVertDict
    // U ===================================================================================
	
    vert_00
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.002614672282429738  -0.02988584094275236  -0.2);
				end					(-0.002614672282429738  -0.02988584094275236  0.15);
				nPoints				200;
			}
		);
		fields	(U Sac Sch4 Gch4);
	}

	vert_01
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(0.002614672282429738  0.02988584094275236  -0.2);
				end					(0.002614672282429738  0.02988584094275236  0.15);
				nPoints				200;
			}
		);
		fields	(U Sac Sch4 Gch4);
	}

	vert_02
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.01968177086971521  -0.02264128740668317  -0.2);
				end					(-0.01968177086971521  -0.02264128740668317  0.15);
				nPoints				200;
			}
		);
		fields	(U Sac Sch4 Gch4);
	}

	vert_03
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(0.01968177086971521  0.02264128740668317  -0.2);
				end					(0.01968177086971521  0.02264128740668317  0.15);
				nPoints				200;
			}
		);
		fields	(U Sac Sch4 Gch4);
	}

	vert_04
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.029231101943557058  -0.006748531630315959  -0.2);
				end					(-0.029231101943557058  -0.006748531630315959  0.15);
				nPoints				200;
			}
		);
		fields	(U Sac Sch4 Gch4);
	}

	vert_05
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(0.029231101943557058  0.006748531630315959  -0.2);
				end					(0.029231101943557058  0.006748531630315959  0.15);
				nPoints				200;
			}
		);
		fields	(U Sac Sch4 Gch4);
	}

	vert_06
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.02761514560357321  0.011721933854678204  -0.2);
				end					(-0.02761514560357321  0.011721933854678204  0.15);
				nPoints				200;
			}
		);
		fields	(U Sac Sch4 Gch4);
	}

	vert_07
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(0.02761514560357321  -0.011721933854678204  -0.2);
				end					(0.02761514560357321  -0.011721933854678204  0.15);
				nPoints				200;
			}
		);
		fields	(U Sac Sch4 Gch4);
	}

	vert_08
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.015451142247301632  0.025715019021063358  -0.2);
				end					(-0.015451142247301632  0.025715019021063358  0.15);
				nPoints				200;
			}
		);
		fields	(U Sac Sch4 Gch4);
	}

	vert_09
	{
		type						sets;
		libs						("libsampling.so");
		timeStart					45;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(0.015451142247301632  -0.025715019021063358  -0.2);
				end					(0.015451142247301632  -0.025715019021063358  0.15);
				nPoints				200;
			}
		);
		fields	(U Sac Sch4 Gch4);
	}